#  Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону 
# (т.е. не меньше заданного минимума и не больше заданного максимума)
list_1 = list()
number = int(input('введите кол-во элементов массива')) #пользователь вводит число 
list_2 = list() 
for i in range(number): 
 n = int(input('введите элемент массива')) # пользователь вводит целое число
 list_1.append(n) # 
number1 = int(input('введите минимальный диапазон ')) #пользователь вводит число 
number2 = int(input('введите максимальный диапазон ')) #пользователь вводит число 
for i in range(number): 
  if number1<=list_1[i]<=number2:
    list_2.append(i)

print(list_2)